# 활동 선택
N = 10  # 10개의 활동
a = [1,4,1,6,6,10,5,7,3,8,5,9,3,5,8,11,2,13,12,15]
# 두개씩 시작시간,종료시간
meet = []
for i in range(N):
    meet.append([a[i*2],a[i*2+1]])
# print(meet)    #[[1,4],[1,6]....
meet.sort(key=lambda x:x[1])  # 1번인덱스 숫자로 정렬
# print(meet)
#[[1, 4], [3, 5], [1, 6], [5, 7], [3, 8], [5, 9], [6, 10], [8, 11], [2, 13], [12, 15]]
meet = [[0,0]]+meet # 첫번째 활동도 뒤에 끝나는 시간이랑 비교해주려고


S = []
j = 0
for i in range(1,N+1):
    if meet[j][1] <= meet[i][0]:    # si>=fj
        S.append(i)
        j = i
print(S)   #[1, 4, 8, 10] 이 번호의 활동을 선택함
